Documents/Рейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Рейс</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доставка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки25</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пункт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОперацииРейсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Содержимое</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку25</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПланирования</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументПланированияДоставки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>В базовых ЕИ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформацияПоДоставке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеУсловияПеревозки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеУсловияПеревозкиОписание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечнаяТочкаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечнаяЗонаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОперацииРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииРейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исходящая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки25</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашКурьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Рейс/Ext/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив Из Строка - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("ДоставкаТоваров");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументОбъект.Рейс, ДокументСсылка.Рейс - ссылка на документ или объект, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений Из Строка, Структура - коллекция элементов - таблиц значений - данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.Рейс") Тогда
		
		ДокументОбъект = Документ;
		ДокументСсылка = Документ.Ссылка;
		
	Иначе
		
		ДокументОбъект = Документ.ПолучитьОбъект();
		ДокументСсылка = Документ;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений; // СписокЗначений из Строка
	
	ПолучитьДанныеДокумента(Запрос, ДокументСсылка);
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		ТекстЗапросаДоставкаТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект, ДопПараметры);
		
	КонецЕсли;
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	БизнесПроцессы.Задание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	НоваяКоманда = Документы.РасходныйОрдерНаТовары.ДобавитьКомандуСоздатьНаОснованииРасходныйОрдерНаТовары(КомандыСозданияНаОсновании);
	Если НоваяКоманда <> Неопределено Тогда
		
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
			НоваяКоманда,
			"Статус",
			Перечисления.СтатусыРейсов.КСборке);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// Подготавливает данные печати.
// 
// Параметры:
//  ИсточникиДанных - см. УправлениеПечатьюПереопределяемый.ПриПодготовкеДанныхПечати.ИсточникиДанных
//  ВнешниеНаборыДанных - см. УправлениеПечатьюПереопределяемый.ПриПодготовкеДанныхПечати.ВнешниеНаборыДанных
//  КодЯзыка - см. УправлениеПечатьюПереопределяемый.ПриПодготовкеДанныхПечати.КодЯзыка
//  ДополнительныеПараметры - см. УправлениеПечатьюПереопределяемый.ПриПодготовкеДанныхПечати.ДополнительныеПараметры
//
Процедура ПриПодготовкеДанныхПечати(ИсточникиДанных, ВнешниеНаборыДанных, КодЯзыка, ДополнительныеПараметры) Экспорт
	
	ДанныеПечати = ДанныеПечатиМаршрутныйЛист(ИсточникиДанных);
	ДанныеМаршрутов = ДанныеПечати.ДанныеМаршрутов;
	ДанныеПоРаспоряжениям = ДанныеПечати.ДанныеПоРаспоряжениям;
	ДанныеПоДокументамПланирования = ДанныеПечати.ДанныеПоДокументамПланирования;
	ДанныеРейса = НаборДанныхРейса(ДанныеМаршрутов, ДанныеПоРаспоряжениям, ДанныеПоДокументамПланирования);
	ВнешниеНаборыДанных.Вставить("НаборМаршруты", ДанныеРейса.НаборМаршрутов);
	ВнешниеНаборыДанных.Вставить("НаборИтогов", ДанныеРейса.ТаблицаИтогов);
	
КонецПроцедуры

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "УправлениеПечатью";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Идентификатор = "Документ.Рейс.ПФ_MXL_МаршрутныйЛист";
	КомандаПечати.Представление = НСтр("ru = 'Маршрутный лист рейса'");
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Отчеты.СборкаПоРейсу.ДобавитьКомандуОтчета(КомандыОтчетов, Параметры, "СборкаПоДаннымРейса");
	Отчеты.СборкаПоРейсу.ДобавитьКомандуОтчета(КомандыОтчетов, Параметры, "СборкаНезависимоОтРейса");
	
	Отчеты.НакладныеПоРаспоряжениямРейса.ДобавитьКомандуОтчета(
		КомандыОтчетов,
		Параметры,
		"НакладныеПоРаспоряжениямРейса");
	
	Отчеты.МаршрутРейса.ДобавитьКомандуОтчета(КомандыОтчетов, Параметры, "МаршрутРейса");
	
КонецПроцедуры

// Описание логики ограничений прав доступа
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(СкладОтправления)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ДляВсехСтрок(ЧтениеОбъектаРазрешено(Маршрут.Пункт, ПустаяСсылка КАК Истина, Null КАК Истина))
	|	И ДляВсехСтрок(ЧтениеОбъектаРазрешено(Содержимое.Распоряжение, ПустаяСсылка КАК Истина, Null КАК Истина))
	|	И ЗначениеРазрешено(Перевозчик, ПустаяСсылка КАК Истина)";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает строковое предоставление состояния рейса.
// 
// Параметры:
//  Объект - ДокументОбъект.Рейс -
//  	   - ДанныеФормыСтруктура: см. Документ.Рейс.Форма.ФормаДокумента.Объект
// 
// Возвращаемое значение:
//  Строка 
// 
Функция СостояниеРейса(Объект) Экспорт
	
	ТекущееСостоянияРейса = "";
	Статус = Объект.Статус;
	СостоянияРейса = СостоянияРейсаПоСтатусу();
	Если Статус = Перечисления.СтатусыРейсов.КСборке Тогда
		
		ТекущееСостоянияРейса = СостояниеРейсаВСтатусеКСборке(Объект.Ссылка);
		
	ИначеЕсли СостоянияРейса[Статус] <> Неопределено Тогда 
		
		ТекущееСостоянияРейса = СостоянияРейса[Статус];
		
	КонецЕсли;
	
	Возврат ТекущееСостоянияРейса;
	
КонецФункции

// Параметры:
//  ИзмененныеСтроки - Массив Из ДанныеФормыЭлементКоллекции:
//  * ДокументПланирования - ОпределяемыйТип.ДокументПланированияДоставки
//  * КодСтроки - Число
//
Процедура ЗаполнитьДополнительныеПараметрыСодержимого(ИзмененныеСтроки) Экспорт
	
	ДокументыПланирования = Новый Массив; // Массив Из ОпределяемыйТип.ДокументПланированияДоставки
	Для Каждого Строка Из ИзмененныеСтроки Цикл
		ДокументыПланирования.Добавить(Строка.ДокументПланирования);
	КонецЦикла;
	
	ВсеДопПараметры = ДоставкаТоваров.ВсеДополнительныеПараметрыИзСтрокДокументов(ДокументыПланирования);
	Отбор = Новый Структура;
	Отбор.Вставить("ДокументДоставки", Неопределено);
	Отбор.Вставить("КодСтроки", 0);
	ЗаполняемыеПараметры = "ВремяДоставкиС,ВремяДоставкиПо,ДополнительнаяИнформацияПоДоставке,ОсобыеУсловияПеревозки,ОсобыеУсловияПеревозкиОписание";
	
	Для Каждого Строка Из ИзмененныеСтроки Цикл
		
		Отбор.ДокументДоставки = Строка.ДокументПланирования;
		Отбор.КодСтроки = Строка.КодСтроки;
		СтрокиПараметров = ВсеДопПараметры.НайтиСтроки(Отбор);
		
		Если СтрокиПараметров.Количество() = 0 Тогда
			
			Отбор.КодСтроки = 0;
			СтрокиПараметров = ВсеДопПараметры.НайтиСтроки(Отбор);
			
		КонецЕсли;
		
		Если СтрокиПараметров.Количество() > 0 Тогда
			
			ЗаполнитьЗначенияСвойств(Строка, СтрокиПараметров[0], ЗаполняемыеПараметры);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

#Область ДанныеДокумента

Процедура ПолучитьДанныеДокумента(Запрос, ДокументСсылка)
	
	СписокЗапросов = Новый Массив; // Массив из Строка
	
	ТекстЗапросаДанныеДокументаШапка(СписокЗапросов);
	ТекстЗапросаДанныеТаблицаТовары(СписокЗапросов);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеДокументаШапка(СписокЗапросов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Статус КАК Статус,
	|	ДанныеДокумента.ДатаВыезда КАК ДатаВыезда,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.СпособДоставки КАК СпособДоставки,
	|	ДанныеДокумента.СкладОтправления КАК СкладОтправления,
	|	ДанныеДокумента.СкладОтправления.ИспользоватьОрдернуюСхемуПриОтгрузке
	|		И ДанныеДокумента.СкладОтправления.НачинатьОтгрузкуПослеФормированияЗаданияНаПеревозку
	|		И (ДанныеДокумента.СкладОтправления.ДатаНачалаОрдернойСхемыПриОтгрузке = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДанныеДокумента.СкладОтправления.ДатаНачалаОрдернойСхемыПриОтгрузке <= ДанныеДокумента.ДатаВыезда) КАК СборкаРейсаОрдерами,
	|	ДанныеДокумента.ТочкаОтправления КАК ТочкаОтправления,
	|	ДанныеДокумента.ЗонаОтправления КАК ЗонаОтправления,
	|	ДанныеДокумента.Перевозчик КАК Перевозчик,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	ДанныеДокумента.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ДанныеДокументаШапка
	|ИЗ
	|	Документ.Рейс КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ТекстЗапросаДанныеТаблицаТовары(СписокЗапросов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаСодержимое.Ссылка КАК Ссылка,
	|	ТаблицаСодержимое.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаМаршрут.Пункт) = ТИП(Справочник.Склады)
	|				И ТаблицаМаршрут.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииРейсов.Погрузка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Исходящая)
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаМаршрут.Пункт) = ТИП(Справочник.Склады)
	|				И ТаблицаМаршрут.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииРейсов.Разгрузка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Входящая)
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаМаршрут.Пункт) = ТИП(Справочник.Партнеры)
	|				И ТаблицаМаршрут.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииРейсов.Погрузка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Входящая)
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаМаршрут.Пункт) = ТИП(Справочник.Партнеры)
	|				И ТаблицаМаршрут.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииРейсов.Разгрузка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДоставки.Исходящая)
	|	КОНЕЦ КАК ТипДоставки,
	|	ТаблицаМаршрут.Пункт КАК Пункт,
	|	ТаблицаМаршрут.ТочкаДоставки КАК ТочкаПункта,
	|	ТаблицаМаршрут.ЗонаДоставки КАК ЗонаПункта,
	|	ЕСТЬNULL(ДоставкаКонечноеПлечо.Получатель, НЕОПРЕДЕЛЕНО) КАК КонечныйПункт,
	|	ТаблицаСодержимое.КонечнаяТочкаДоставки КАК КонечнаяТочкаДоставки,
	|	ТаблицаСодержимое.КонечнаяЗонаДоставки КАК КонечнаяЗонаДоставки,
	|	ТаблицаСодержимое.Номенклатура КАК Номенклатура,
	|	ТаблицаСодержимое.Характеристика КАК Характеристика,
	|	ТаблицаСодержимое.Серия КАК Серия,
	|	ТаблицаСодержимое.Количество КАК Количество,
	|	ТаблицаСодержимое.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаСодержимое.Упаковка КАК Упаковка,
	|	ТаблицаСодержимое.ВесНетто КАК ВесНетто,
	|	ТаблицаСодержимое.Вес КАК Вес,
	|	ТаблицаСодержимое.Объем КАК Объем,
	|	ТаблицаСодержимое.Распоряжение КАК Распоряжение,
	|	ТаблицаСодержимое.ДокументПланирования КАК ДокументПланирования,
	|	ТаблицаСодержимое.КодСтроки КАК КодСтроки,
	|	ТаблицаСодержимое.Отменено КАК Отменено
	|ПОМЕСТИТЬ ДанныеДокументаТаблицаТовары
	|ИЗ
	|	Документ.Рейс.Содержимое КАК ТаблицаСодержимое
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Маршрут КАК ТаблицаМаршрут
	|		ПО ТаблицаСодержимое.Ссылка = ТаблицаМаршрут.Ссылка
	|			И ТаблицаСодержимое.КлючСвязи = ТаблицаМаршрут.КлючСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Доставка КАК ДоставкаКонечноеПлечо
	|		ПО ТаблицаСодержимое.Распоряжение = ДоставкаКонечноеПлечо.Распоряжение
	|			И ТаблицаСодержимое.ДокументПланирования = ДоставкаКонечноеПлечо.ДокументПланирования
	|			И ТаблицаСодержимое.КодСтроки = ДоставкаКонечноеПлечо.КодСтроки
	|			И (ДоставкаКонечноеПлечо.ЭтоКонечноеПлечо)
	|			И (ДоставкаКонечноеПлечо.УровеньОперации В (15, 20))
	|ГДЕ
	|	ТаблицаСодержимое.Ссылка = &Ссылка
	|	И НЕ 1 В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|				1
	|			ИЗ
	|				РегистрСведений.ИсправленияДокументов КАК ИсправленияДокументов
	|			ГДЕ
	|				ИсправленияДокументов.ИсправляемыйДокумент = ДоставкаКонечноеПлечо.Регистратор
	|				ИЛИ ИсправленияДокументов.ПредыдущееИсправление = ДоставкаКонечноеПлечо.Регистратор)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	СтатусыДляСборкиНаСкладе = Новый Массив; // Массив из ПеречислениеСсылка.СтатусыРейсов
	СтатусыДляСборкиНаСкладе.Добавить(Перечисления.СтатусыРейсов.Сформирован);
	СтатусыДляСборкиНаСкладе.Добавить(Перечисления.СтатусыРейсов.КСборке);
	СтатусыДляСборкиНаСкладе.Добавить(Перечисления.СтатусыРейсов.Отправлен);
	СтатусыДляСборкиНаСкладе.Добавить(Перечисления.СтатусыРейсов.Завершен);
	Запрос.УстановитьПараметр("СтатусыДляСборкиНаСкладе", СтатусыДляСборкиНаСкладе);
	
	Реквизиты = РеквизитыДокумента(Запрос);
	
	Запрос.УстановитьПараметр("Период", Реквизиты.Дата);
	Запрос.УстановитьПараметр("Статус", Реквизиты.Статус);
	Запрос.УстановитьПараметр("ДатаВыезда", Реквизиты.ДатаВыезда);
	Запрос.УстановитьПараметр("ФормироватьДвиженияСборки", Реквизиты.ФормироватьДвиженияСборки);
	Запрос.УстановитьПараметр("Статус", Реквизиты.Статус);
	Запрос.УстановитьПараметр("Статус", Реквизиты.Статус);
	Запрос.УстановитьПараметр("Статус", Реквизиты.Статус);
	
	УровеньОперации = ДоставкаТоваров.УровеньОперацииДокумента(ДокументСсылка);
	Запрос.УстановитьПараметр("УровеньОперации", УровеньОперации);
	
КонецПроцедуры

// Параметры:
//  Запрос - Запрос - Запрос
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Реквизиты документа:
//  * Дата - Дата
//  * Статус - ПеречислениеСсылка.СтатусыРейсов
//  * ДатаВыезда - Дата
//  * ФормироватьДвиженияСборки - Булево
//
Функция РеквизитыДокумента(Запрос)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументаШапка.Дата КАК Дата,
	|	ДанныеДокументаШапка.Статус КАК Статус,
	|	ДанныеДокументаШапка.ДатаВыезда КАК ДатаВыезда,
	|	ДанныеДокументаШапка.СборкаРейсаОрдерами
	|		И ДанныеДокументаШапка.Статус В (&СтатусыДляСборкиНаСкладе) КАК ФормироватьДвиженияСборки
	|ИЗ
	|	ДанныеДокументаШапка КАК ДанныеДокументаШапка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Реквизиты = РезультатЗапроса.Выбрать();
	Реквизиты.Следующий();
	
	Возврат Реквизиты;
	
КонецФункции

Функция ТекстЗапросаДоставкаТоваров(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект, ДопПараметры = Неопределено)
	
	ИмяРегистра = "Доставка";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК Период,
	|	ШапкаДокумента.Организация КАК Организация,
	|	ТаблицаТовары.ТипДоставки КАК ТипДоставки,
	|	ШапкаДокумента.ДатаВыезда КАК ДатаОтгрузки,
	|	ШапкаДокумента.СпособДоставки КАК СпособДоставки,
	|	ШапкаДокумента.СкладОтправления КАК Отправитель,
	|	ШапкаДокумента.ТочкаОтправления КАК ТочкаОтправителя,
	|	ШапкаДокумента.ЗонаОтправления КАК ЗонаОтправителя,
	|	ТаблицаТовары.Пункт КАК Получатель,
	|	ТаблицаТовары.ТочкаПункта КАК ТочкаПолучателя,
	|	ТаблицаТовары.ЗонаПункта КАК ЗонаПолучателя,
	|	ТаблицаТовары.ДокументПланирования КАК ДокументПланирования,
	|	ТаблицаТовары.Распоряжение КАК Распоряжение,
	|	&Ссылка КАК Рейс,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Серия КАК Серия,
	|	ТаблицаТовары.КодСтроки КАК КодСтроки,
	|	1 КАК Плечо,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ШапкаДокумента.Перевозчик КАК Перевозчик,
	|	0 КАК КДоставке,
	|	0 КАК КРейсу,
	|	ТаблицаТовары.Количество КАК ВРейсе,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРейсов.Отправлен)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВПути,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРейсов.Завершен)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Доставлено,
	|	0 КАК Отменено,
	|	ВЫБОР
	|		КОГДА &ФормироватьДвиженияСборки
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КСборке,
	|	0 КАК Собирается,
	|	0 КАК Собрано,
	|	&УровеньОперации КАК УровеньОперации,
	|	ТаблицаТовары.Пункт = ТаблицаТовары.КонечныйПункт КАК ЭтоКонечноеПлечо,
	|	1 КАК НомерМинимальногоПлеча,
	|	ЛОЖЬ КАК ПервичнаяЗапись,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПервичнаяДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	|ИЗ
	|	ДанныеДокументаТаблицаТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Рейс КАК ШапкаДокумента
	|		ПО ТаблицаТовары.Ссылка = ШапкаДокумента.Ссылка
	|ГДЕ
	|	НЕ ТаблицаТовары.Отменено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки,
	|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
	|	ШапкаДокумента.Организация,
	|	ТаблицаТовары.ТипДоставки,
	|	ШапкаДокумента.ДатаВыезда,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.СиламиПеревозчика),
	|	ТаблицаТовары.Пункт,
	|	ТаблицаТовары.ТочкаПункта,
	|	ТаблицаТовары.ЗонаПункта,
	|	ТаблицаТовары.КонечныйПункт,
	|	ТаблицаТовары.КонечнаяТочкаДоставки,
	|	ТаблицаТовары.КонечнаяЗонаДоставки,
	|	ТаблицаТовары.ДокументПланирования,
	|	ТаблицаТовары.Распоряжение,
	|	&Ссылка,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Серия,
	|	ТаблицаТовары.КодСтроки,
	|	2,
	|	ТаблицаТовары.Упаковка,
	|	ТаблицаТовары.Пункт,
	|	0,
	|	0,
	|	ТаблицаТовары.Количество,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРейсов.Отправлен)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ШапкаДокумента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРейсов.Завершен)
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	ВЫБОР
	|		КОГДА &ФормироватьДвиженияСборки
	|			ТОГДА ТаблицаТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	&УровеньОперации,
	|	ИСТИНА,
	|	0,
	|	ЛОЖЬ,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ИЗ
	|	ДанныеДокументаТаблицаТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДокументаШапка КАК ШапкаДокумента
	|		ПО ТаблицаТовары.Ссылка = ШапкаДокумента.Ссылка
	|ГДЕ
	|	ШапкаДокумента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки25.НашимиСилами)
	|	И ТаблицаТовары.Пункт <> ТаблицаТовары.КонечныйПункт
	|	И НЕ ТаблицаТовары.Отменено";
	
	СинонимТаблицыДокумента = "ТаблицаТовары";
	ДоставкаТоваров.УстановитьПараметрыЗапросаПроведения(Запрос, ДопПараметры);
	ДоставкаТоваров.ДополнитьЗапросОтраженияДокумента(Запрос, Регистры, ТекстыЗапроса, ТекстЗапроса, СинонимТаблицыДокумента);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ДанныеПечати

// Параметры:
//  МассивОбъектов  см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
// 
// Возвращаемое значение:
//  Структура:
// * ДанныеМаршрутов - ВыборкаИзРезультатаЗапроса:
//  ** Ссылка - ДокументСсылка.Рейс
//  ** НомерСтроки - Число
//  ** ВремяДоставкиС - Дата
//  ** ВремяДоставкиПо - Дата
//  ** КлючСвязи - Строка
//  ** ТочкаПогрузки - Булево
// * ДанныеПоРаспоряжениям - ТаблицаЗначений:
//  ** Ссылка - ДокументСсылка.Рейс
//  ** КлючСвязи - Строка
//  ** Распоряжение - Строка
//  ** Вес - Число
//  ** Объем - Число
// * ДанныеПоДокументамПланирования - ТаблицаЗначений:
//  ** Ссылка - ДокументСсылка.Рейс
//  ** КлючСвязи - Строка
//  ** ДополнительнаяИнформацияПоДоставке - Строка
//  ** ОсобыеУсловияПеревозкиОписание - Строка
// 
Функция ДанныеПечатиМаршрутныйЛист(МассивОбъектов)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РейсМаршрут.Ссылка КАК Ссылка,
	|	РейсМаршрут.НомерСтроки КАК НомерСтроки,
	|	РейсМаршрут.ВремяДоставкиС КАК ВремяДоставкиС,
	|	РейсМаршрут.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	РейсМаршрут.КлючСвязи КАК КлючСвязи,
	|	ВЫБОР
	|		КОГДА РейсМаршрут.НомерСтроки = 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТочкаПогрузки
	|ИЗ
	|	Документ.Рейс.Маршрут КАК РейсМаршрут
	|ГДЕ
	|	РейсМаршрут.Ссылка В (&МассивОбъектов)
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РейсСодержимое.Ссылка КАК Ссылка,
	|	РейсСодержимое.КлючСвязи КАК КлючСвязи,
	|	СУММА(РейсСодержимое.Вес) КАК Вес,
	|	СУММА(РейсСодержимое.Объем) КАК Объем,
	|	ПРЕДСТАВЛЕНИЕ(РейсСодержимое.Распоряжение) КАК Распоряжение
	|ИЗ
	|	Документ.Рейс.Содержимое КАК РейсСодержимое
	|ГДЕ
	|	РейсСодержимое.Ссылка В (&МассивОбъектов)
	|	И НЕ РейсСодержимое.Отменено
	|СГРУППИРОВАТЬ ПО
	|	РейсСодержимое.Ссылка,
	|	РейсСодержимое.КлючСвязи,
	|	РейсСодержимое.Распоряжение,
	|	ПРЕДСТАВЛЕНИЕ(РейсСодержимое.Распоряжение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РейсСодержимое.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РейсСодержимое.Ссылка КАК Ссылка,
	|	РейсСодержимое.КлючСвязи КАК КлючСвязи,
	|	РейсСодержимое.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	РейсСодержимое.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание
	|ИЗ
	|	Документ.Рейс.Содержимое КАК РейсСодержимое
	|ГДЕ
	|	РейсСодержимое.Ссылка В (&МассивОбъектов)
	|	И НЕ РейсСодержимое.Отменено";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Результат = Запрос.ВыполнитьПакет();
	МаксимальныйИндекс = Результат.ВГраница();
	ДанныеМаршрутов = Результат[МаксимальныйИндекс - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеПоРаспоряжениям = Результат[МаксимальныйИндекс - 1].Выгрузить(); // ТаблицаЗначений
	ДанныеПоДокументамПланирования = Результат[МаксимальныйИндекс].Выгрузить(); // ТаблицаЗначений
	
	ДанныеМаршрутныхЛистов = Новый Структура;
	ДанныеМаршрутныхЛистов.Вставить("ДанныеМаршрутов", ДанныеМаршрутов);
	ДанныеМаршрутныхЛистов.Вставить("ДанныеПоРаспоряжениям", ДанныеПоРаспоряжениям);
	ДанныеМаршрутныхЛистов.Вставить("ДанныеПоДокументамПланирования", ДанныеПоДокументамПланирования);
	
	Возврат ДанныеМаршрутныхЛистов;
	
КонецФункции

Функция НаборДанныхРейса(ДанныеМаршрутов, ДанныеПоРаспоряжениям, ДанныеПоДокументамПланирования)
	
	НаборМаршрутов = ТаблицаМаршрутов();
	ТаблицаИтогов = НоваяТаблицаИтоговМаршрутногоЛиста();
	
	Пока ДанныеМаршрутов.Следующий() Цикл
		
		Выборка = ДанныеМаршрутов.Выбрать();
		Маршрут = ДанныеМаршрутов(Выборка, ДанныеПоРаспоряжениям, ДанныеПоДокументамПланирования);
		
		НоваяСтрока = НаборМаршрутов.Добавить();
		НоваяСтрока.Ссылка = ДанныеМаршрутов.Ссылка;
		НоваяСтрока.Маршрут = Маршрут;
		
		Отбор = Новый Структура;
		Отбор.Вставить("АктуальнаяТочка", Истина);
		НайденныеСтроки = Маршрут.НайтиСтроки(Отбор);
		ВесТочкиДоставки = 0;
		ОбъемТочкиДоставки = 0;
		
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			
			ВесТочкиДоставки = ВесТочкиДоставки + ТекущаяСтрока.ВесТочкиДоставки;
			ОбъемТочкиДоставки = ОбъемТочкиДоставки + ТекущаяСтрока.ОбъемТочкиДоставки;
			
		КонецЦикла;
		
		НоваяСтрокаИтогов = ТаблицаИтогов.Добавить();
		НоваяСтрокаИтогов.Ссылка = ДанныеМаршрутов.Ссылка;
		НоваяСтрокаИтогов.КоличествоТочекДоставки = НайденныеСтроки.Количество();
		НоваяСтрокаИтогов.Вес = ВесТочкиДоставки;
		НоваяСтрокаИтогов.Объем = ОбъемТочкиДоставки;
		
	КонецЦикла;
	
	ДанныеРейса = Новый Структура;
	ДанныеРейса.Вставить("НаборМаршрутов", НаборМаршрутов);
	ДанныеРейса.Вставить("ТаблицаИтогов", ТаблицаИтогов);
	
	Возврат ДанныеРейса;
	
КонецФункции

Функция ДанныеМаршрутов(Выборка, ДанныеПоРаспоряжениям, ДанныеПоДокументамПланирования)
	
	ТаблицаМаршрута = НоваяТаблицаМаршрута();
	НомерСтрокиДляПечати = 0;
	Пока Выборка.Следующий() Цикл
		
		Распоряжения = "";
		ОтборПоискаРаспоряжений = Новый Структура;
		ОтборПоискаРаспоряжений.Вставить("Ссылка", Выборка.Ссылка);
		ОтборПоискаРаспоряжений.Вставить("КлючСвязи", Выборка.КлючСвязи);
		
		НайденныеСтроки = ДанныеПоРаспоряжениям.НайтиСтроки(ОтборПоискаРаспоряжений);
		ТочкаДоставкиОбъем = 0;
		ТочкаДоставкиВес = 0;
		СчетчикРаспоряжений = 0;
		ЕстьДанныеПоДоставке = Ложь;
		ВремяДоставкиС = Выборка.ВремяДоставкиС;
		ВремяДоставкиПо = Выборка.ВремяДоставкиПо;
		
		Для Каждого ТекущаяНайденнаяСтрока Из НайденныеСтроки Цикл
			
			ЕстьДанныеПоДоставке = Истина;
			СчетчикРаспоряжений = СчетчикРаспоряжений + 1;
			ТочкаДоставкиОбъем = ТочкаДоставкиОбъем + ТекущаяНайденнаяСтрока.Объем;
			ТочкаДоставкиВес = ТочкаДоставкиВес + ТекущаяНайденнаяСтрока.Вес;
			
			Распоряжение = ТекущаяНайденнаяСтрока.Распоряжение;
			Если СчетчикРаспоряжений = 1 Тогда
				Распоряжения = Распоряжение;
			Иначе
				Распоряжения = Распоряжения + Символы.ПС + Распоряжение;
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрока = ТаблицаМаршрута.Добавить();
		НоваяСтрока.НомерСтроки = Выборка.НомерСтроки;
		НоваяСтрока.ОбъемТочкиДоставки = ТочкаДоставкиОбъем;
		НоваяСтрока.ВесТочкиДоставки = ТочкаДоставкиВес;
		НоваяСтрока.РаспоряженияТочкиДоставки = Распоряжения;
		
		ФорматВремени = "ДФ=HH:mm";
		
		Если ЗначениеЗаполнено(ВремяДоставкиС)
		 И ЗначениеЗаполнено(ВремяДоставкиПо) Тогда
			
			ШаблонВремяДоставки = "%1 - %2";
			НоваяСтрока.ВремяДоставкиПредставление = СтрШаблон(
				ШаблонВремяДоставки,
				Формат(ВремяДоставкиС, ФорматВремени),
				Формат(ВремяДоставкиПо, ФорматВремени));
			
		ИначеЕсли ЗначениеЗаполнено(ВремяДоставкиС) Тогда
			
			НоваяСтрока.ВремяДоставкиПредставление = Формат(ВремяДоставкиС, ФорматВремени);
			
		ИначеЕсли ЗначениеЗаполнено(ВремяДоставкиПо) Тогда
			
			НоваяСтрока.ВремяДоставкиПредставление = Формат(ВремяДоставкиПо, ФорматВремени);
			
		КонецЕсли;
		
		Если ЕстьДанныеПоДоставке
		 ИЛИ Выборка.ТочкаПогрузки Тогда
			
			НомерСтрокиДляПечати = НомерСтрокиДляПечати + 1;
			НоваяСтрока.НомерСтрокиДляПечати = НомерСтрокиДляПечати;
			НоваяСтрока.АктуальнаяТочка = Истина;
			
		КонецЕсли;
		
		НайденныеСтроки = ДанныеПоДокументамПланирования.НайтиСтроки(ОтборПоискаРаспоряжений);
		ДобавленныеВариантыОсобыхУсловий = Новый Соответствие;
		ДобавленныеВариантыДопИнформации = Новый Соответствие;
		Для Каждого ТекущаяНайденнаяСтрока Из НайденныеСтроки Цикл
			
			ОсобыеУсловияТовара = ТекущаяНайденнаяСтрока.ОсобыеУсловияПеревозкиОписание;
			Если ЗначениеЗаполнено(ОсобыеУсловияТовара) Тогда
				
				Хеш = ДоставкаТоваров.ХешЗначимыхСимволовСтроки(ОсобыеУсловияТовара);
				Если ДобавленныеВариантыОсобыхУсловий[Хеш] = Неопределено Тогда
					
					НоваяСтрока.ОсобыеУсловия = НоваяСтрока.ОсобыеУсловия + Символы.ПС + ОсобыеУсловияТовара;
					ДобавленныеВариантыОсобыхУсловий.Вставить(Хеш, Истина);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ДопИнформацияТовара = ТекущаяНайденнаяСтрока.ДополнительнаяИнформацияПоДоставке;
			Если ЗначениеЗаполнено(ДопИнформацияТовара) Тогда
				
				Хеш = ДоставкаТоваров.ХешЗначимыхСимволовСтроки(ДопИнформацияТовара);
				Если ДобавленныеВариантыДопИнформации[Хеш] = Неопределено Тогда
					
					НоваяСтрока.ДополнительнаяИнформация = НоваяСтрока.ДополнительнаяИнформация + Символы.ПС + ДопИнформацияТовара;
					ДобавленныеВариантыДопИнформации.Вставить(Хеш, Истина);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НоваяСтрока.ОсобыеУсловия = СокрЛП(НоваяСтрока.ОсобыеУсловия);
		НоваяСтрока.ДополнительнаяИнформация = СокрЛП(НоваяСтрока.ДополнительнаяИнформация);
		
	КонецЦикла;
	
	Возврат ТаблицаМаршрута;
	
КонецФункции

// Возвращает таблицу значений для внешнего набора макета ДополнительныеДанныеПечати.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица товаров проверка:
// * Ссылка - ДокументСсылка.Рейс
// * Маршрут - см. НоваяТаблицаМаршрута
//
Функция ТаблицаМаршрутов()
	
	ОписаниеТиповСсылки = Новый ОписаниеТипов("ДокументСсылка.Рейс");
	ОписаниеТиповТЗ = Новый ОписаниеТипов("ТаблицаЗначений");
	
	Маршруты = Новый ТаблицаЗначений;
	Маршруты.Колонки.Добавить("Ссылка", ОписаниеТиповСсылки);
	Маршруты.Колонки.Добавить("Маршрут", ОписаниеТиповТЗ);
	
	Возврат Маршруты;
	
КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений:
// * НомерСтроки  - Число
// * ВремяДоставкиПредставление - Строка
// * ВесТочкиДоставки - Число
// * ОбъемТочкиДоставки - Число
// * РаспоряженияТочкиДоставки - Строка
// * НомерСтрокиДляПечати  - Число
// * АктуальнаяТочка  - Булево
// * ДополнительнаяИнформация - Строка
// * ОсобыеУсловия - Строка
// 
Функция НоваяТаблицаМаршрута()
	
	ТаблицаМаршрута = Новый ТаблицаЗначений;
	
	ОписаниеТипаЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
	ОписаниеТипа = Новый ОписаниеТипов("Строка");
	ОписаниеТипаСтрока20 = ОбщегоНазначения.ОписаниеТипаСтрока(20);
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	
	Колонки = ТаблицаМаршрута.Колонки;
	Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	Колонки.Добавить("ВремяДоставкиПредставление", ОписаниеТипаСтрока20);
	Колонки.Добавить("ВесТочкиДоставки", ОписаниеТипаЧисло);
	Колонки.Добавить("ОбъемТочкиДоставки", ОписаниеТипаЧисло);
	Колонки.Добавить("РаспоряженияТочкиДоставки", ОписаниеТипа);
	Колонки.Добавить("НомерСтрокиДляПечати", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	Колонки.Добавить("АктуальнаяТочка", ОписаниеТипаБулево);
	Колонки.Добавить("ДополнительнаяИнформация", ОписаниеТипа);
	Колонки.Добавить("ОсобыеУсловия", ОписаниеТипа);
	
	Возврат ТаблицаМаршрута;
	
КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений - Итоги для ПФ ПФ_MXL_МаршрутныйЛист:
// * Ссылка - ДокументСсылка.Рейс
// * КоличествоТочекДоставки - Число
// * Вес - Число
// * Объем - Число
// 
Функция НоваяТаблицаИтоговМаршрутногоЛиста()
	
	ТаблицаИтогов = Новый ТаблицаЗначений;
	
	ОписаниеТипаЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
	ОписаниеТиповСсылки = Новый ОписаниеТипов("ДокументСсылка.Рейс");
	
	Колонки = ТаблицаИтогов.Колонки;
	Колонки.Добавить("Ссылка", ОписаниеТиповСсылки);
	Колонки.Добавить("КоличествоТочекДоставки", ОписаниеТипаЧисло);
	Колонки.Добавить("Вес", ОписаниеТипаЧисло);
	Колонки.Добавить("Объем", ОписаниеТипаЧисло);
	
	Возврат ТаблицаИтогов;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - ПеречислениеСсылка.СтатусыРейсов -
//  * Значение - Строка -
//
Функция СостоянияРейсаПоСтатусу()
	
	СостоянияРейса = Новый Соответствие;
	
	СостояниеПредставление = НСтр("ru = 'В процессе формирования'");
	СостоянияРейса.Вставить(Перечисления.СтатусыРейсов.Подготовлен, СостояниеПредставление);
	
	СостояниеПредставление = НСтр("ru = 'Готов к отправке'");
	СостоянияРейса.Вставить(Перечисления.СтатусыРейсов.Сформирован, СостояниеПредставление);
	
	СостояниеПредставление = НСтр("ru = 'В процессе доставки'");
	СостоянияРейса.Вставить(Перечисления.СтатусыРейсов.Отправлен, СостояниеПредставление);
	
	СостояниеПредставление = НСтр("ru = 'Завершен'");
	СостоянияРейса.Вставить(Перечисления.СтатусыРейсов.Завершен, СостояниеПредставление);
	
	СостояниеПредставление = НСтр("ru = 'Отменен'");
	СостоянияРейса.Вставить(Перечисления.СтатусыРейсов.Отменен, СостояниеПредставление);
	
	Возврат СостоянияРейса;
	
КонецФункции

// Параметры:
//  Рейс -  ДокументСсылка.Рейс
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//   * КСборке - Число
//   * ЗапланированаСборка - Число
//   * Собирается - Число
//   * Собрано - Число
//
Функция ДанныеПоСборкеРейса(Рейс)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДоставкаОбороты.Рейс КАК Рейс,
	|	ДоставкаОбороты.Плечо КАК Плечо,
	|	ВЫБОР
	|		КОГДА ДоставкаОбороты.Плечо = &НомерПлечаСборка
	|			ТОГДА ДоставкаОбороты.КСборкеОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КСборке,
	|	ДоставкаОбороты.ЗапланированаСборкаОборот КАК ЗапланированаСборка,
	|	ДоставкаОбороты.СобираетсяОборот КАК Собирается,
	|	ДоставкаОбороты.СобраноОборот КАК Собрано
	|ПОМЕСТИТЬ ВТ_Обороты
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(, , , Рейс = &Рейс) КАК ДоставкаОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.Рейс КАК Рейс,
	|	СУММА(Обороты.КСборке) КАК КСборке,
	|	СУММА(Обороты.ЗапланированаСборка) КАК ЗапланированаСборка,
	|	СУММА(Обороты.Собирается) КАК Собирается,
	|	СУММА(Обороты.Собрано) КАК Собрано
	|ИЗ
	|	ВТ_Обороты КАК Обороты
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Рейс";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Запрос.УстановитьПараметр("НомерПлечаСборка", 1);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Параметры:
//  Рейс - ДокументСсылка.Рейс -
// 
// Возвращаемое значение:
//  Строка
//
Функция СостояниеРейсаВСтатусеКСборке(Рейс)
	
	СостояниеРейса = "";
	СостояниеСборкаНаСкладе = НСтр("ru = 'Сборка на складе'");
	
	Выборка = ДанныеПоСборкеРейса(Рейс);
	Если Выборка.Следующий() Тогда
		
		Если Выборка.КСборке = 0 Тогда
			
			СостояниеРейса = СостояниеСборкаНаСкладе;
			
		ИначеЕсли Выборка.КСборке > (Выборка.ЗапланированаСборка + Выборка.Собирается + Выборка.Собрано) Тогда
			
			СостояниеРейса = НСтр("ru = 'Ожидаются ордера'");
			
		ИначеЕсли Выборка.КСборке > Выборка.Собрано Тогда
			
			СостояниеРейса = НСтр("ru = 'Сформированы ордера'");
			
		ИначеЕсли Выборка.КСборке <= Выборка.Собрано Тогда
			
			СостояниеРейса = НСтр("ru = 'Собрано'");
			
		КонецЕсли;
		
	Иначе
		
		СостояниеРейса = СостояниеСборкаНаСкладе;
		
	КонецЕсли;
	
	Возврат СостояниеРейса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
